Which NYC schools have the best math results?

The best math results are at least 80% of the *maximum possible score of 800* for math.
Save your results in a pandas DataFrame called best_math_schools, including "school_name" and "average_math" columns, sorted by "average_math" in descending order.
What are the top 10 performing schools based on the combined SAT scores?

Save your results as a pandas DataFrame called top_10_schools containing the "school_name" and a new column named "total_SAT", with results ordered by "total_SAT" in descending order ("total_SAT" being the sum of math, reading, and writing scores).
Which single borough has the largest standard deviation in the combined SAT score?

Save your results as a pandas DataFrame called largest_std_dev.
The DataFrame should contain one row, with:
"borough" - the name of the NYC borough with the largest standard deviation of "total_SAT".
"num_schools" - the number of schools in the borough.
"average_SAT" - the mean of "total_SAT".
"std_SAT" - the standard deviation of "total_SAT".
Round all numeric values to two decimal places.

In [15]:
import pandas as pd
import matplotlib.pyplot as plt

In [16]:
df=pd.read_csv('schools.csv')

In [17]:
df.head()

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9
2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1
3,High School for Dual Language and Asian Studies,Manhattan,M445,613,453,463,95.9
4,Henry Street School for International Studies,Manhattan,M056,410,406,381,59.7

In [18]:
best_math_results=df[df['average_math']>=640]
best_math_schools=best_math_results[["school_name",'average_math']].sort_values(by='average_math',ascending=False)

In [19]:
df['total_SAT']=df['average_math']+df['average_reading']+df['average_writing']
top_10_schools=df[['school_name','total_SAT']].sort_values(by='total_SAT',ascending=False).head(10)

In [ ]:
boroughs=df.groupby("borough")["total_SAT"].aggregate(["count","mean","std"])

In [22]:
borough_std_single=boroughs[boroughs["std"]==boroughs["std"].max()]

In [23]:
borough_std_single

           count         mean        std
borough
Manhattan     89  1340.134831  230.29414